app/controllers/posts_controller.rb

SELECT  "favorites".* FROM "favorites" WHERE "favorites"."user_id" = $1 AND "favorites"."post_id" = $2 LIMIT $3  [["user_id", 1], ["post_id", 1], ["LIMIT", 1]]
---
  def show
    @favorite = current_user.favorites.find_by(post_id: @post.id)

INSERT INTO "posts" ("content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
---
  def create
    @post = current_user.posts.build(post_params)
    #@post = Post.new(post_params)
    if params[:back]
      render :new
    else
      if @post.save

UPDATE "posts" SET "content" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["content", "bonjour ez je comprend un peu un peu le concept de MCV"], ["updated_at", "2021-05-01 07:16:38.497633"], ["id", 1]]
---
  def update
    if @post.update(post_params)